; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	spectrograph1 - mode
	infrared4 - mode
	thermograph5 - mode
	spectrograph2 - mode
	infrared3 - mode
	infrared0 - mode
	infrared6 - mode
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	GroundStation6 - direction
	Star0 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 infrared6)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 thermograph5)
	(supports instrument1 infrared6)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 thermograph5)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument3 spectrograph2)
	(supports instrument3 spectrograph1)
	(supports instrument3 infrared6)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation6)
	(supports instrument4 thermograph5)
	(supports instrument4 infrared4)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation5)
	(supports instrument5 infrared4)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
)
(:goal (and
	(pointing satellite0 Phenomenon9)
	(pointing satellite1 Star10)
	(have_image Planet7 spectrograph1)
	(have_image Planet8 infrared3)
	(have_image Planet8 thermograph5)
	(have_image Phenomenon9 infrared3)
	(have_image Star10 infrared4)
	(have_image Star10 spectrograph2)
	(have_image Phenomenon11 infrared6)
	(have_image Phenomenon11 spectrograph2)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 10
2. (calibrate satellite1 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 0 of 10
3. (turn_to satellite1 star10 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star10)
   goals met: 1 of 10
4. (take_image satellite1 star10 instrument3 spectrograph2)
   added: (have_image star10 spectrograph2)
   goals met: 2 of 10
5. (turn_to satellite1 planet7 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 planet7)
   goals met: 1 of 10
6. (take_image satellite1 planet7 instrument3 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 2 of 10
7. (turn_to satellite1 phenomenon11 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 10
8. (turn_to satellite0 phenomenon9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 10
9. (take_image satellite1 phenomenon11 instrument3 spectrograph2)
   added: (have_image phenomenon11 spectrograph2)
   goals met: 4 of 10
10. (take_image satellite1 phenomenon11 instrument3 infrared6)
   added: (have_image phenomenon11 infrared6)
   goals met: 5 of 10
11. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 5 of 10
12. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 5 of 10
13. (turn_to satellite1 groundstation5 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 groundstation5)
   goals met: 5 of 10
14. (calibrate satellite1 instrument4 groundstation5)
   added: (calibrated instrument4)
   goals met: 5 of 10
15. (turn_to satellite1 phenomenon9 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 phenomenon9)
   goals met: 5 of 10
16. (take_image satellite1 phenomenon9 instrument4 infrared3)
   added: (have_image phenomenon9 infrared3)
   goals met: 6 of 10
17. (turn_to satellite1 planet8 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet8)
   goals met: 6 of 10
18. (take_image satellite1 planet8 instrument4 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 7 of 10
19. (take_image satellite1 planet8 instrument4 thermograph5)
   added: (have_image planet8 thermograph5)
   goals met: 8 of 10
20. (turn_to satellite1 star10 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star10)
   goals met: 9 of 10
21. (take_image satellite1 star10 instrument4 infrared4)
   added: (have_image star10 infrared4)
   goals met: 10 of 10
